astb_relise/src/Documents/ПриказПоНормамВыдачиСИЗ/ПриказПоНормамВыдачиСИЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриказПоНормамВыдачиСИЗ</name>
  <registerRecords>InformationRegister.УстановленныеНормыВыдачиСИЗ</registerRecords>
  <registerRecords>InformationRegister.ДоступныеУсловияРаботыСотрудника</registerRecords>
  <registerRecords>AccumulationRegister.ПотребностьВыдачиСИЗ</registerRecords>
  <registerRecords>AccumulationRegister.ВыдачаПоПотребности</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздательДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗачетВыданныхСредствЗащиты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НормыВыдачиСИЗ</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиИПрофессии</types>
      </type>
    </attributes>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.РабочиеМестаАСТБ</types>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеНормы</name>
      <type>
        <types>CatalogRef.УсловияНорм</types>
      </type>
    </attributes>
    <attributes>
      <name>НормаВыдачи</name>
      <type>
        <types>CatalogRef.НормыВыдачиСИЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>Использовать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

astb_relise/src/Documents/ПриказПоНормамВыдачиСИЗ/Forms/ФормаДокумента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Свойства
 	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект,НОВЫЙ Структура("ИмяЭлементаДляРазмещения","ГруппаДополнительныеРеквизиты"));
	// Конец СтандартныеПодсистемы.Свойства
	
	ЭтаФорма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Организация", Объект.Организация));

	ЭтаФорма.Элементы.НормыВыдачиСИЗ.КоманднаяПанель.ПодчиненныеЭлементы.НормыВыдачиЗаполнить.Доступность = (НЕ Объект.Проведен);
	
	ЭтаФорма.ТолькоПросмотр = Объект.Проведен;
	Если Объект.Проведен Тогда
		ЭтаФорма.Элементы.ПолеТекстПредупреждения.Заголовок = "Проведенный документ доступен только на просмотр";
		ЭтаФорма.Элементы.ГруппаПредупреждение.Видимость = Истина;
	Иначе	
		ЭтаФорма.Элементы.ГруппаПредупреждение.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтаФорма, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
 	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЭтаФорма.Элементы.НормыВыдачиСИЗ.КоманднаяПанель.ПодчиненныеЭлементы.НормыВыдачиЗаполнить.Доступность = (НЕ Объект.Проведен);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтаФорма, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Обработка.ПодборПодразделений.Форма.Форма" Тогда
		
		ЗаполнитьПоПодразделениямНаСервере(ВыбранноеЗначение.АдресРезультатаПодбораВХранилище);
		
	КонецЕсли;
	
	Если ИсточникВыбора.ИмяФормы = "Обработка.ПодборДолжностей.Форма.Форма" Тогда
		
		ЗаполнитьПоДолжностямНаСервере(ВыбранноеЗначение.АдресРезультатаПодбораВХранилище);
		
	КонецЕсли;
	
	Если Окно <> Неопределено Тогда
		Окно.Активизировать();
	КонецЕсли;

	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ЭтаФорма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Организация", Объект.Организация));

КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Документы.ПриказПоНормамВыдачиСИЗ.ЗаполнитьНормыВыдачиСИЗ(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПодразделениям(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Документ",							Объект.Ссылка);
	ПараметрыФормы.Вставить("Организация",						Объект.Организация);
	
	ОткрытьФорму("Обработка.ПодборПодразделений.Форма.Форма",ПараметрыФормы,ЭтаФорма,УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоПодразделениямНаСервере(АдресРезультатаПодбораВХранилище)
	
	МассивПодразделений = ПолучитьИзВременногоХранилища(АдресРезультатаПодбораВХранилище);
	
	Документы.ПриказПоНормамВыдачиСИЗ.ЗаполнитьНормыВыдачиСИЗ(Объект,МассивПодразделений);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДолжностям(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Документ",							Объект.Ссылка);
	ПараметрыФормы.Вставить("Организация",						Объект.Организация);
	
	ОткрытьФорму("Обработка.ПодборДолжностей.Форма.Форма",ПараметрыФормы,ЭтаФорма,УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДолжностямНаСервере(АдресРезультатаПодбораВХранилище)
	
	МассивДолжностей = ПолучитьИзВременногоХранилища(АдресРезультатаПодбораВХранилище);
	
	Документы.ПриказПоНормамВыдачиСИЗ.ЗаполнитьНормыВыдачиСИЗ(Объект,,МассивДолжностей);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоПерсональнойВыдачеНаСервере()
	
	Документы.ПриказПоНормамВыдачиСИЗ.ЗаполнитьНормыВыдачиСИЗ(Объект,,,Истина,Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПерсональнойВыдаче(Команда)
	
	ЗаполнитьПоПерсональнойВыдачеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоКоллективнойВыдачеНаСервере()
	
	Документы.ПриказПоНормамВыдачиСИЗ.ЗаполнитьНормыВыдачиСИЗ(Объект,,,Ложь, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоКоллективнойВыдаче(Команда)
	
	ЗаполнитьПоКоллективнойВыдачеНаСервере();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДСИСТЕМЫ "СВОЙСТВА"

// СтандартныеПодсистемы.Свойства
 &НаКлиенте
Процедура Подключаемый_РедактироватьСоставСвойств()
	
	УправлениеСвойствамиКлиент.РедактироватьСоставСвойств(ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ...

// СтандартныеПодсистемы.Свойства
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НормыВыдачиСИЗПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	//документ заполняется из исходных норм
	Отказ = Истина;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства
